app/controllers/hoots_controller.rb

INSERT INTO "hoots" ("author_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author_id", 1], ["body", "Hello World!"], ["created_at", "2020-05-19 05:38:53.662051"], ["updated_at", "2020-05-19 05:38:53.662051"]]
---
    def create
        @hoot = Hoot.new(hoot_params)
        @hoot.author_id = current_user.id
        @hoot.save

SELECT  "hoots".* FROM "hoots" WHERE "hoots"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "hoots" WHERE "hoots"."id" = $1  [["id", 1]]
---
    def destroy
        @hoot = Hoot.find(params[:hoot][:id])
        if @hoot.destroy