app/controllers/users_controller.rb

    def create
        @user = User.new(user_param)
        if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "age", "gender", "house", "description", "created_at", "updated_at", "username", "password_digest", "session_token") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

    def update
        @user = User.find_by(id: params[:id])
        if @user.update(user_param)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "description" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["description", "Hello! Let's play it fair."], ["updated_at", "2020-05-17 22:59:18.581152"], ["id", 7]]