app/models/user.rb

UPDATE "users" SET "updated_at" = $1, "session_token" = $2 WHERE "users"."id" = $3  [["updated_at", "2020-05-19 03:59:36.843612"], ["session_token", "RR5lGNLu44yxd1bL8fqa2g"], ["id", 1]]
---
    def reset_session_token!
        self.session_token = SecureRandom::urlsafe_base64
        self.save!